cfMesh/boundingBox/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-3.25		-0.4 	-0.05)//0
    (3.75        	-0.4          -0.05)//1
    (3.75        	1.60       -0.05)//2
    (-3.25		1.60	-0.05)//3

    (-3.25          	-0.4        0.05)//4
    (3.75         	-0.4        0.05)//5
    (3.75         	1.60     0.05)//6
    (-3.25          	1.60     0.05)//7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 1) simpleGrading (1 1 1)
);

edges
(
);
//do not change what follows
boundary
(
    top
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (4 5 1 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 7 3 0)
        );
     }

    outlet
    {
        type patch;
        faces
        (
            (5 1 2 6)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
	    (4 7 6 5)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
