cfMesh/boundingBox/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          1;
        startFace       0;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       1;
    }
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       2;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       3;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2;
        startFace       4;
    }
)

// ************************************************************************* //
