cfMesh/boundingBox/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


momentumSource
{
    type            meanVelocityForce;
    active          yes;            //on/off switch

    meanVelocityForceCoeffs
    {
        selectionMode   all;       //cellSet // points //cellZone

        fields      (U);
        Ubar        (1 0 0 );
        relaxation  1.0; 
    }
}

// ************************************************************************* //


